---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Insert(Autodesk.Revit.DB.Electrical.TemperatureRatingType)
source: html/02846bf2-f1ef-d360-fbaf-66b3376d778f.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Insert Method

Insert the specified TemperatureRating type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	TemperatureRatingType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.TemperatureRatingType`) - The TemperatureRating type to be inserted into the set.

## Returns
Returns whether the TemperatureRating type was inserted into the set.